brew "k9s"
brew "k3d"
brew "kubectl"
brew "helm"
brew "kubectx"
brew "kubie"
brew "arkade"
brew "tilt"
brew "kustomize"
cask "freelens"
brew "jq"
brew "yq"


# Brewfile for k8s-home-lab dev tools

# --- Core tools you already use ---
brew "gomplate"
brew "gum"
brew "helm"
brew "just"
brew "k3sup"
brew "kubelogin"
brew "openbao"

# --- Kubernetes / GitOps helpers ---
brew "kubectl"        # Kubernetes CLI
brew "k9s"            # TUI for managing Kubernetes clusters
brew "kind"           # Run Kubernetes in Docker
brew "jq"             # JSON processor
brew "yq"             # YAML processor
brew "stern"          # Tail multiple pod logs
tap "fluxcd/tap"
brew "fluxcd/tap/flux" # GitOps toolkit

# --- Container runtimes & CLIs ---
brew "podman"         # Podman CLI (Docker alternative)
brew "podman-compose" # Docker Compose-like wrapper for Podman
cask "docker-desktop"

# --- Optional DevOps utilities ---
brew "httpie"         # Simple HTTP client
brew "watch"          # Re-run commands at intervals
brew "tree"           # Directory listings

